---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.MechanicalEquipment
source: html/bea61a0a-61fa-c864-5de9-7c164ad44adb.htm
---
# MechanicalEquipment Members

Causes the object to release immediately any resources it may be utilizing.